# Terminal foundation
brew "starship"
brew "fzf"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "ghostty"

# Daily CLI tools
brew "git"
brew "gh"
brew "ghq"
brew "fnm"
brew "pnpm"
brew "ripgrep"
brew "fd"
brew "eza"
brew "jq"
brew "chezmoi"
brew "gitleaks"
brew "microsoft/apm/apm"

# Prompt glyphs and terminal icons
cask "font-hack-nerd-font"
